Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlabShapeEditFailed Property
 Slab Shape Edit failed. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlabShapeEditFailed { get; }
Public Shared ReadOnly Property SlabShapeEditFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlabShapeEditFailed {
	FailureDefinitionId^ get ();
}
static member SlabShapeEditFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace